Tekla Open API Reference for Tekla Structures 2025
Reinforcement.Grade Property
 Gets or sets the steel grade of the reinforcing bar. The grade indicates the strength of the steel used in reinforcing bars. It can also indicate other factors, such as the weldability or surface deformations of the bar.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Grade { get; set; }
Public Property Grade As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace